app/Controllers/AuthController.php

        $remember = $this->request->getPost('remember');

        // Cari user berdasarkan email
        $user = $this->userModel->where('email', $email)
            ->where('status', 'active')
            ->first();
---
SELECT *
FROM `users`
WHERE `email` = 'admin@cendratama.co.id'
AND `status` = 'active'
 LIMIT 1

        }

        // Update last login
        $this->userModel->update($user['id'], ['last_login' => date('Y-m-d H:i:s')]);
---
UPDATE `users` SET `last_login` = '2025-12-18 18:01:27', `updated_at` = '2025-12-18 18:01:27'
WHERE `users`.`id` IN ('1')